# Taps
tap "osx-cross/avr"
tap "LargeModGames/spotatui"
tap "slp/krun"

# Core configuration
brew "chezmoi"
brew "mise"
brew "git"
brew "zsh"
brew "zsh-completions"
brew "gnupg"
brew "pinentry"

# Shell and terminal tools
brew "starship"
brew "fzf"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "zoxide"
brew "ripgrep"
brew "fd"
brew "eza"
brew "bat"
brew "tmux"
brew "htop"
brew "lima"
brew "krunkit"

# Native build and media dependencies
brew "cmake"
brew "cppcheck"
brew "pkgconf"
brew "cairo"
brew "ffmpeg"
brew "openal-soft"
brew "just"
brew "wakeonlan"

# .NET
brew "dotnet"
brew "dotnet@8"

# Version control and editors
brew "jujutsu"
brew "jjui"
brew "neovim"
brew "tree-sitter-cli"

# General development tools
brew "uv"
brew "jq"
brew "qemu"
brew "mas"

# AVR / embedded
brew "avra"
brew "avrdude"
brew "avr-gcc"
brew "sdl2"
brew "spotatui"

# Desktop applications presently in use
cask "karabiner-elements"
cask "kitty"
cask "zed"
cask "utm"
cask "docker-desktop"
cask "raycast"
cask "loop"
cask "obsidian"
cask "protonvpn"
cask "proton-pass"
cask "cryptomator"
cask "xpra"

# Mac App Store
mas "Amphetamine", id: 937984704
mas "Week Number", id: 6502579523
mas "Pure Paste", id: 1611378436
mas "Displaperture", id: 1543920362
mas "Command X", id: 6448461551
mas "DaVinci Resolve", id: 571213070
